cache-practice/k6-no-cache-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/test-no-cache.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m01.0s/2m00.0s

running (0m02.0s), 004/100 VUs, 35 complete and 0 interrupted iterations
default   [   2% ] 004/100 VUs  0m02.0s/2m00.0s

running (0m03.0s), 005/100 VUs, 75 complete and 0 interrupted iterations
default   [   2% ] 005/100 VUs  0m03.0s/2m00.0s

running (0m04.0s), 007/100 VUs, 130 complete and 0 interrupted iterations
default   [   3% ] 007/100 VUs  0m04.0s/2m00.0s

running (0m05.0s), 009/100 VUs, 199 complete and 0 interrupted iterations
default   [   4% ] 009/100 VUs  0m05.0s/2m00.0s

running (0m06.0s), 010/100 VUs, 284 complete and 0 interrupted iterations
default   [   5% ] 010/100 VUs  0m06.0s/2m00.0s

running (0m07.0s), 012/100 VUs, 383 complete and 0 interrupted iterations
default   [   6% ] 012/100 VUs  0m07.0s/2m00.0s

running (0m08.0s), 014/100 VUs, 496 complete and 0 interrupted iterations
default   [   7% ] 014/100 VUs  0m08.0s/2m00.0s

running (0m09.0s), 015/100 VUs, 625 complete and 0 interrupted iterations
default   [   7% ] 015/100 VUs  0m09.0s/2m00.0s

running (0m10.0s), 017/100 VUs, 761 complete and 0 interrupted iterations
default   [   8% ] 017/100 VUs  0m10.0s/2m00.0s

running (0m11.0s), 018/100 VUs, 919 complete and 0 interrupted iterations
default   [   9% ] 018/100 VUs  0m11.0s/2m00.0s

running (0m12.0s), 020/100 VUs, 1092 complete and 0 interrupted iterations
default   [  10% ] 020/100 VUs  0m12.0s/2m00.0s

running (0m13.0s), 022/100 VUs, 1279 complete and 0 interrupted iterations
default   [  11% ] 022/100 VUs  0m13.0s/2m00.0s

running (0m14.0s), 023/100 VUs, 1481 complete and 0 interrupted iterations
default   [  12% ] 023/100 VUs  0m14.0s/2m00.0s

running (0m15.0s), 025/100 VUs, 1699 complete and 0 interrupted iterations
default   [  12% ] 025/100 VUs  0m15.0s/2m00.0s

running (0m16.0s), 027/100 VUs, 1925 complete and 0 interrupted iterations
default   [  13% ] 027/100 VUs  0m16.0s/2m00.0s

running (0m17.0s), 028/100 VUs, 2179 complete and 0 interrupted iterations
default   [  14% ] 028/100 VUs  0m17.0s/2m00.0s

running (0m18.0s), 030/100 VUs, 2440 complete and 0 interrupted iterations
default   [  15% ] 030/100 VUs  0m18.0s/2m00.0s

running (0m19.0s), 032/100 VUs, 2716 complete and 0 interrupted iterations
default   [  16% ] 032/100 VUs  0m19.0s/2m00.0s

running (0m20.0s), 033/100 VUs, 2999 complete and 0 interrupted iterations
default   [  17% ] 033/100 VUs  0m20.0s/2m00.0s

running (0m21.0s), 035/100 VUs, 3304 complete and 0 interrupted iterations
default   [  17% ] 035/100 VUs  0m21.0s/2m00.0s

running (0m22.0s), 036/100 VUs, 3635 complete and 0 interrupted iterations
default   [  18% ] 036/100 VUs  0m22.0s/2m00.0s

running (0m23.0s), 038/100 VUs, 3979 complete and 0 interrupted iterations
default   [  19% ] 038/100 VUs  0m23.0s/2m00.0s

running (0m24.0s), 040/100 VUs, 4337 complete and 0 interrupted iterations
default   [  20% ] 040/100 VUs  0m24.0s/2m00.0s

running (0m25.0s), 041/100 VUs, 4702 complete and 0 interrupted iterations
default   [  21% ] 041/100 VUs  0m25.0s/2m00.0s

running (0m26.0s), 043/100 VUs, 5081 complete and 0 interrupted iterations
default   [  22% ] 043/100 VUs  0m26.0s/2m00.0s

running (0m27.0s), 045/100 VUs, 5484 complete and 0 interrupted iterations
default   [  22% ] 045/100 VUs  0m27.0s/2m00.0s

running (0m28.0s), 046/100 VUs, 5926 complete and 0 interrupted iterations
default   [  23% ] 046/100 VUs  0m28.0s/2m00.0s

running (0m29.0s), 048/100 VUs, 6351 complete and 0 interrupted iterations
default   [  24% ] 048/100 VUs  0m29.0s/2m00.0s

running (0m30.0s), 049/100 VUs, 6789 complete and 0 interrupted iterations
default   [  25% ] 049/100 VUs  0m30.0s/2m00.0s

running (0m31.0s), 050/100 VUs, 7239 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m31.0s/2m00.0s

running (0m32.0s), 051/100 VUs, 7745 complete and 0 interrupted iterations
default   [  27% ] 051/100 VUs  0m32.0s/2m00.0s

running (0m33.0s), 052/100 VUs, 8210 complete and 0 interrupted iterations
default   [  27% ] 052/100 VUs  0m33.0s/2m00.0s

running (0m34.0s), 053/100 VUs, 8682 complete and 0 interrupted iterations
default   [  28% ] 053/100 VUs  0m34.0s/2m00.0s

running (0m35.0s), 054/100 VUs, 9192 complete and 0 interrupted iterations
default   [  29% ] 054/100 VUs  0m35.0s/2m00.0s

running (0m36.0s), 054/100 VUs, 9688 complete and 0 interrupted iterations
default   [  30% ] 054/100 VUs  0m36.0s/2m00.0s

running (0m37.0s), 055/100 VUs, 10195 complete and 0 interrupted iterations
default   [  31% ] 055/100 VUs  0m37.0s/2m00.0s

running (0m38.0s), 056/100 VUs, 10700 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m38.0s/2m00.0s
time="2025-11-23T20:04:06+09:00" level=warning msg="The test has generated metrics with 100269 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m39.0s), 057/100 VUs, 11238 complete and 0 interrupted iterations
default   [  32% ] 057/100 VUs  0m39.0s/2m00.0s

running (0m40.0s), 058/100 VUs, 11779 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m40.0s/2m00.0s

running (0m41.0s), 059/100 VUs, 12303 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m41.0s/2m00.0s

running (0m42.0s), 059/100 VUs, 12854 complete and 0 interrupted iterations
default   [  35% ] 059/100 VUs  0m42.0s/2m00.0s

running (0m43.0s), 060/100 VUs, 13417 complete and 0 interrupted iterations
default   [  36% ] 060/100 VUs  0m43.0s/2m00.0s

running (0m44.0s), 061/100 VUs, 13980 complete and 0 interrupted iterations
default   [  37% ] 061/100 VUs  0m44.0s/2m00.0s

running (0m45.0s), 062/100 VUs, 14534 complete and 0 interrupted iterations
default   [  37% ] 062/100 VUs  0m45.0s/2m00.0s

running (0m46.0s), 063/100 VUs, 15115 complete and 0 interrupted iterations
default   [  38% ] 063/100 VUs  0m46.0s/2m00.0s

running (0m47.0s), 064/100 VUs, 15693 complete and 0 interrupted iterations
default   [  39% ] 064/100 VUs  0m47.0s/2m00.0s

running (0m48.0s), 064/100 VUs, 16303 complete and 0 interrupted iterations
default   [  40% ] 064/100 VUs  0m48.0s/2m00.0s

running (0m49.0s), 065/100 VUs, 16888 complete and 0 interrupted iterations
default   [  41% ] 065/100 VUs  0m49.0s/2m00.0s

running (0m50.0s), 066/100 VUs, 17510 complete and 0 interrupted iterations
default   [  42% ] 066/100 VUs  0m50.0s/2m00.0s

running (0m51.0s), 067/100 VUs, 18144 complete and 0 interrupted iterations
default   [  42% ] 067/100 VUs  0m51.0s/2m00.0s

running (0m52.0s), 068/100 VUs, 18751 complete and 0 interrupted iterations
default   [  43% ] 068/100 VUs  0m52.0s/2m00.0s

running (0m53.0s), 069/100 VUs, 19374 complete and 0 interrupted iterations
default   [  44% ] 069/100 VUs  0m53.0s/2m00.0s

running (0m54.0s), 069/100 VUs, 20037 complete and 0 interrupted iterations
default   [  45% ] 069/100 VUs  0m54.0s/2m00.0s

running (0m55.0s), 070/100 VUs, 20614 complete and 0 interrupted iterations
default   [  46% ] 070/100 VUs  0m55.0s/2m00.0s

running (0m56.0s), 071/100 VUs, 21275 complete and 0 interrupted iterations
default   [  47% ] 071/100 VUs  0m56.0s/2m00.0s

running (0m57.0s), 072/100 VUs, 21953 complete and 0 interrupted iterations
default   [  47% ] 072/100 VUs  0m57.0s/2m00.0s
time="2025-11-23T20:04:25+09:00" level=warning msg="The test has generated metrics with 200142 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m58.0s), 073/100 VUs, 22550 complete and 0 interrupted iterations
default   [  48% ] 073/100 VUs  0m58.0s/2m00.0s

running (0m59.0s), 074/100 VUs, 23228 complete and 0 interrupted iterations
default   [  49% ] 074/100 VUs  0m59.0s/2m00.0s

running (1m00.0s), 074/100 VUs, 23915 complete and 0 interrupted iterations
default   [  50% ] 074/100 VUs  1m00.0s/2m00.0s

running (1m01.0s), 075/100 VUs, 24590 complete and 0 interrupted iterations
default   [  51% ] 075/100 VUs  1m01.0s/2m00.0s

running (1m02.0s), 076/100 VUs, 25292 complete and 0 interrupted iterations
default   [  52% ] 076/100 VUs  1m02.0s/2m00.0s

running (1m03.0s), 077/100 VUs, 26011 complete and 0 interrupted iterations
default   [  52% ] 077/100 VUs  1m03.0s/2m00.0s

running (1m04.0s), 078/100 VUs, 26717 complete and 0 interrupted iterations
default   [  53% ] 078/100 VUs  1m04.0s/2m00.0s

running (1m05.0s), 079/100 VUs, 27437 complete and 0 interrupted iterations
default   [  54% ] 079/100 VUs  1m05.0s/2m00.0s

running (1m06.0s), 079/100 VUs, 28178 complete and 0 interrupted iterations
default   [  55% ] 079/100 VUs  1m06.0s/2m00.0s

running (1m07.0s), 080/100 VUs, 28907 complete and 0 interrupted iterations
default   [  56% ] 080/100 VUs  1m07.0s/2m00.0s

running (1m08.0s), 081/100 VUs, 29657 complete and 0 interrupted iterations
default   [  57% ] 081/100 VUs  1m08.0s/2m00.0s

running (1m09.0s), 082/100 VUs, 30398 complete and 0 interrupted iterations
default   [  57% ] 082/100 VUs  1m09.0s/2m00.0s

running (1m10.0s), 083/100 VUs, 31149 complete and 0 interrupted iterations
default   [  58% ] 083/100 VUs  1m10.0s/2m00.0s

running (1m11.0s), 084/100 VUs, 31901 complete and 0 interrupted iterations
default   [  59% ] 084/100 VUs  1m11.0s/2m00.0s

running (1m12.0s), 084/100 VUs, 32716 complete and 0 interrupted iterations
default   [  60% ] 084/100 VUs  1m12.0s/2m00.0s

running (1m13.0s), 085/100 VUs, 33492 complete and 0 interrupted iterations
default   [  61% ] 085/100 VUs  1m13.0s/2m00.0s

running (1m14.0s), 086/100 VUs, 34278 complete and 0 interrupted iterations
default   [  62% ] 086/100 VUs  1m14.0s/2m00.0s

running (1m15.0s), 087/100 VUs, 35084 complete and 0 interrupted iterations
default   [  62% ] 087/100 VUs  1m15.0s/2m00.0s

running (1m15.9s), 088/100 VUs, 35873 complete and 0 interrupted iterations
default   [  63% ] 088/100 VUs  1m16.0s/2m00.0s

running (1m16.9s), 089/100 VUs, 36666 complete and 0 interrupted iterations
default   [  64% ] 089/100 VUs  1m17.0s/2m00.0s

running (1m17.9s), 089/100 VUs, 37467 complete and 0 interrupted iterations
default   [  65% ] 089/100 VUs  1m18.0s/2m00.0s

running (1m18.9s), 090/100 VUs, 38307 complete and 0 interrupted iterations
default   [  66% ] 090/100 VUs  1m19.0s/2m00.0s

running (1m19.9s), 091/100 VUs, 39133 complete and 0 interrupted iterations
default   [  67% ] 091/100 VUs  1m20.0s/2m00.0s

running (1m20.9s), 092/100 VUs, 39916 complete and 0 interrupted iterations
default   [  67% ] 092/100 VUs  1m21.0s/2m00.0s

running (1m21.9s), 093/100 VUs, 40787 complete and 0 interrupted iterations
default   [  68% ] 093/100 VUs  1m22.0s/2m00.0s

running (1m22.9s), 094/100 VUs, 41649 complete and 0 interrupted iterations
default   [  69% ] 094/100 VUs  1m23.0s/2m00.0s

running (1m23.9s), 094/100 VUs, 42515 complete and 0 interrupted iterations
default   [  70% ] 094/100 VUs  1m24.0s/2m00.0s

running (1m24.9s), 095/100 VUs, 43379 complete and 0 interrupted iterations
default   [  71% ] 095/100 VUs  1m25.0s/2m00.0s

running (1m25.9s), 096/100 VUs, 44276 complete and 0 interrupted iterations
default   [  72% ] 096/100 VUs  1m26.0s/2m00.0s

running (1m26.9s), 097/100 VUs, 45175 complete and 0 interrupted iterations
default   [  72% ] 097/100 VUs  1m27.0s/2m00.0s
time="2025-11-23T20:04:54+09:00" level=warning msg="The test has generated metrics with 400365 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (1m27.9s), 098/100 VUs, 46061 complete and 0 interrupted iterations
default   [  73% ] 098/100 VUs  1m28.0s/2m00.0s

running (1m28.9s), 099/100 VUs, 46984 complete and 0 interrupted iterations
default   [  74% ] 099/100 VUs  1m29.0s/2m00.0s

running (1m29.9s), 099/100 VUs, 47905 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  1m30.0s/2m00.0s

running (1m30.9s), 097/100 VUs, 48825 complete and 0 interrupted iterations
default   [  76% ] 097/100 VUs  1m31.0s/2m00.0s

running (1m31.9s), 094/100 VUs, 49686 complete and 0 interrupted iterations
default   [  77% ] 094/100 VUs  1m32.0s/2m00.0s

running (1m32.9s), 091/100 VUs, 50537 complete and 0 interrupted iterations
default   [  77% ] 091/100 VUs  1m33.0s/2m00.0s

running (1m33.9s), 088/100 VUs, 51342 complete and 0 interrupted iterations
default   [  78% ] 088/100 VUs  1m34.0s/2m00.0s

running (1m34.9s), 084/100 VUs, 52156 complete and 0 interrupted iterations
default   [  79% ] 084/100 VUs  1m35.0s/2m00.0s

running (1m35.9s), 081/100 VUs, 52931 complete and 0 interrupted iterations
default   [  80% ] 081/100 VUs  1m36.0s/2m00.0s

running (1m36.9s), 077/100 VUs, 53656 complete and 0 interrupted iterations
default   [  81% ] 077/100 VUs  1m37.0s/2m00.0s

running (1m37.9s), 074/100 VUs, 54350 complete and 0 interrupted iterations
default   [  82% ] 074/100 VUs  1m38.0s/2m00.0s

running (1m38.9s), 071/100 VUs, 55033 complete and 0 interrupted iterations
default   [  82% ] 071/100 VUs  1m39.0s/2m00.0s

running (1m39.9s), 067/100 VUs, 55687 complete and 0 interrupted iterations
default   [  83% ] 067/100 VUs  1m40.0s/2m00.0s

running (1m40.9s), 064/100 VUs, 56279 complete and 0 interrupted iterations
default   [  84% ] 064/100 VUs  1m41.0s/2m00.0s

running (1m41.9s), 061/100 VUs, 56850 complete and 0 interrupted iterations
default   [  85% ] 061/100 VUs  1m42.0s/2m00.0s

running (1m42.9s), 057/100 VUs, 57410 complete and 0 interrupted iterations
default   [  86% ] 057/100 VUs  1m43.0s/2m00.0s

running (1m43.9s), 054/100 VUs, 57937 complete and 0 interrupted iterations
default   [  87% ] 054/100 VUs  1m44.0s/2m00.0s

running (1m44.9s), 051/100 VUs, 58417 complete and 0 interrupted iterations
default   [  87% ] 051/100 VUs  1m45.0s/2m00.0s

running (1m45.9s), 047/100 VUs, 58860 complete and 0 interrupted iterations
default   [  88% ] 047/100 VUs  1m46.0s/2m00.0s

running (1m46.9s), 044/100 VUs, 59273 complete and 0 interrupted iterations
default   [  89% ] 044/100 VUs  1m47.0s/2m00.0s

running (1m47.9s), 041/100 VUs, 59664 complete and 0 interrupted iterations
default   [  90% ] 041/100 VUs  1m48.0s/2m00.0s

running (1m48.9s), 037/100 VUs, 60037 complete and 0 interrupted iterations
default   [  91% ] 037/100 VUs  1m49.0s/2m00.0s

running (1m49.9s), 034/100 VUs, 60375 complete and 0 interrupted iterations
default   [  92% ] 034/100 VUs  1m50.0s/2m00.0s

running (1m50.9s), 031/100 VUs, 60668 complete and 0 interrupted iterations
default   [  92% ] 031/100 VUs  1m51.0s/2m00.0s

running (1m51.9s), 027/100 VUs, 60931 complete and 0 interrupted iterations
default   [  93% ] 027/100 VUs  1m52.0s/2m00.0s

running (1m52.9s), 024/100 VUs, 61164 complete and 0 interrupted iterations
default   [  94% ] 024/100 VUs  1m53.0s/2m00.0s

running (1m53.9s), 021/100 VUs, 61367 complete and 0 interrupted iterations
default   [  95% ] 021/100 VUs  1m54.0s/2m00.0s

running (1m54.9s), 017/100 VUs, 61541 complete and 0 interrupted iterations
default   [  96% ] 017/100 VUs  1m55.0s/2m00.0s

running (1m55.9s), 014/100 VUs, 61684 complete and 0 interrupted iterations
default   [  97% ] 014/100 VUs  1m56.0s/2m00.0s

running (1m56.9s), 011/100 VUs, 61798 complete and 0 interrupted iterations
default   [  97% ] 011/100 VUs  1m57.0s/2m00.0s

running (1m57.9s), 007/100 VUs, 61882 complete and 0 interrupted iterations
default   [  98% ] 007/100 VUs  1m58.0s/2m00.0s

running (1m58.9s), 004/100 VUs, 61936 complete and 0 interrupted iterations
default   [  99% ] 004/100 VUs  1m59.0s/2m00.0s

running (1m59.9s), 001/100 VUs, 61960 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  2m00.0s/2m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 123924  1032.488176/s
    checks_succeeded...: 100.00% 123924 out of 123924
    checks_failed......: 0.00%   0 out of 123924

    ✓ status is 200
    ✓ response time < 500ms

    CUSTOM
    errors.........................: 0.00%  0 out of 61962

    HTTP
    http_req_duration..............: avg=8.32ms   min=56µs    med=6.94ms   max=140.01ms p(90)=11.79ms  p(95)=14.98ms
      { expected_response:true }...: avg=8.32ms   min=56µs    med=6.94ms   max=140.01ms p(90)=11.79ms  p(95)=14.98ms
    http_req_failed................: 0.00%  0 out of 61962
    http_reqs......................: 61962  516.244088/s

    EXECUTION
    iteration_duration.............: avg=108.77ms min=102.9ms med=107.45ms max=240.18ms p(90)=112.37ms p(95)=115.6ms
    iterations.....................: 61962  516.244088/s
    vus............................: 1      min=1          max=99 
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 18 MB  146 kB/s
    data_sent......................: 6.3 MB 52 kB/s



running (2m00.0s), 000/100 VUs, 61962 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s